function xdot=dif(t,x)

mu = 3.986004418e+5;
J2=1082.635854e-06;
J3=-2.56e-6;
R=6378.1;

% J2까지 고려
xdot(1,1)=x(2);  % x(1):r , x(2):r' , x(3):phi , x(4):phi' , x(5):lambda , x(6):lambda' (initial values = x0)
xdot(2,1)=x(1)*x(4)^2+x(1)*(x(6)^2)*(cos(x(3))^2)-mu/(x(1)^2)+1.5*mu*J2*(R^2/x(1)^4)*(3*(sin(x(3))^2)-1); % xdot(2,1) = r"
xdot(3,1)=x(4);
xdot(4,1)=-3*mu*J2*(R^2/(x(1)^5))*sin(x(3))*cos(x(3))-2*x(2)*x(4)/x(1)-(x(6))^2*(sin(x(3))*cos(x(3))); % xdot(4,1) = phi"
xdot(5,1)=x(6);
xdot(6,1)=2*x(6)*x(4)*tan(x(3))-2*x(2)*x(6)/x(1); % xdot(6,1) = lambda"

% J3까지 고려
%xdot(1,1)=x(2);
%xdot(2,1)=x(1)*x(4)^2+x(1)*(x(6)^2)*(cos(x(3))^2)-mu/(x(1)^2)+1.5*mu*J2*(R^2/x(1)^4)*(3*(sin(x(3))^2)-1)+2*mu*J3*(R^3/x(1)^5)*(5*sin(x(3))^2-3)*sin(x(3));
%xdot(3,1)=x(4);
%xdot(4,1)=-3*mu*J2*(R^2/(x(1)^5))*sin(x(3))*cos(x(3))-2*x(2)*x(4)/x(1)-(x(6))^2*(sin(x(3))*cos(x(3)))-1.5*mu*J3*(R^3/x(1)^6)*(5*sin(x(3))^2-1)*cos(x(3));
%xdot(5,1)=x(6);
%xdot(6,1)=2*x(6)*x(4)*tan(x(3))-2*x(2)*x(6)/x(1);